# Базовый словарь магазина, куда мы по очереди вставим все предметы
ITEMS = {}

# ==================== 1. ПЕРЧАТКИ ====================
ITEMS["gloves"] = {
    "leather": {
        "name": "Кожаные перчатки",
        "price": 30,
        "min_level": 0,
        "max_durability": 30.0,
        "luck_boost": 0.05,
        "desc": "Прочность 30%. Удача +5%. Расход 3-5% за карту."
    },
    "reinforced": {
        "name": "Укреплённые перчатки",
        "price": 100,
        "min_level": 1,
        "max_durability": 50.0,
        "luck_boost": 0.10,
        "desc": "Прочность 50%. Удача +10%. Расход 3-5% за карту."
    },
    "magician": {
        "name": "Перчатки фокусника",
        "price": 150,
        "min_level": 1,
        "max_durability": 30.0,
        "luck_boost": 0.30,
        "desc": "Прочность 30%. Удача +30%. Расход 3-5% за карту."
    },
    "boxer": {
        "name": "Перчатки боксёра",
        "price": 150,
        "min_level": 5,
        "max_durability": 100.0,
        "luck_boost": 0.15,
        "desc": "Прочность 100%. Удача +15%. Расход 3-5% за карту."
    },
    "gold_gloves": {
        "name": "Золотые перчатки",
        "price": 250,
        "min_level": 10,
        "max_durability": 250.0,
        "luck_boost": 0.25,
        "desc": "Прочность 250%. Удача +25%. Расход 3-5% за карту."
    },
    "thanos": {
        "name": "Перчатка Таноса",
        "price": 1000,
        "min_level": 15,
        "max_durability": 5000.0,
        "luck_boost": 0.40,
        "desc": "Прочность 5000%. Удача +40%. Расход 3-5% за карту."
    }
}
